import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {
//        Билет №13
//        Необходимо реализовать следующий метод:
//
//        На вход получаем список названий книг.
//        Распределяем книги по полкам так, чтобы на каждой полке было примерно одинаковое количество книг.
//        Все книги должны быть отсортированы по алфавиту с первой до последней полки.
//        Количество полок константное — 5 штук.
//        Вернуть книги, распределенные по полкам.


        List<String> books = new ArrayList<>();
        books.add("Повесть о настоящем человеке");
        books.add("Мастер и Маргарита");
        books.add("Аэропорт");
        books.add("Сказки");
        books.add("Война и мир");
        books.add("Собака Баскервилей");
        books.add("Игра престолов");
        books.add("Том Сойер");
        books.add("Маленький принц");
        books.add("Цитадель");
        books.add("Собачье сердце");
        books.add("Герой нашего времениь");


    }
}